Учебные проекты2/Виртуальные таблицы регистров/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Тип</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Учебные проекты2/Виртуальные таблицы регистров/Enums/Тип.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>Тип</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Учебные проекты2/Виртуальные таблицы регистров/Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.Тип.ЮридическоеЛицо") Тогда
		Элементы.КПП.Видимость=Истина;
	ИначеЕсли
		Объект.Тип = ПредопределенноеЗначение("Перечисление.Тип.ФизическоеЛицо") Тогда
		Элементы.КПП.Видимость=Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.КПП.Видимость=Истина;
КонецПроцедуры 


&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если Не ЗапретНаРасшифровкуНаименования Тогда 
		ТекстРасшифровки = РасшифровкаОПФНаименования(Объект.Наименование);
		Объект.ПолноеНаименование = ТекстРасшифровки; 
	КонецЕсли;	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Функция РасшифровкаОПФНаименования(Наименование)
	СловаНаименования = Строка(Наименование);
	МассивНаименование = СтрРазделить(СловаНаименования," ");
	РасшифровкаОПФ = Новый Соответствие;
	РасшифровкаОПФ.Вставить("ИП", "Индивидуальный предприниматель");
	РасшифровкаОПФ.Вставить("АО", "Акционерное общество");
	РасшифровкаОПФ.Вставить("ПАО", "Публичное акционерное общество");
	РасшифровкаОПФ.Вставить("ООО", "Общество с ограниченной ответственностью");
	РасшифровкаОПФ.Вставить("ЗАО", "Закрытое акционерное общество"); 
	
	МассивНаименованийНовый = Новый Массив;
	Для Каждого Слово Из МассивНаименование Цикл
		ЗначениеСоответствия = РасшифровкаОПФ.Получить(Слово);
		Если ЗначениеСоответствия = Неопределено Тогда
			МассивНаименованийНовый.Добавить(Слово);
		Иначе
			МассивНаименованийНовый.Добавить(ЗначениеСоответствия);
		КонецЕсли;
	КонецЦикла;
	ТекстРасшифровки = СтрСоединить (МассивНаименованийНовый, " ");
	Возврат ТекстРасшифровки;	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ТекстОшибки = "";
	Если НЕ РаботаСИНН.ИННВерен(Объект.ИНН, Объект.Тип,ТекстОшибки) Тогда 
		Отказ = Истина;
		Сообщить (ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	Если РаботаСИНН.ИННВерен(Объект.ИНН, Объект.Тип) Тогда 
		Элементы.ИНН.ЦветТекста = Новый Цвет;
		Элементы.ОшибкаИНН.Видимость = Ложь;
		Элементы.ОшибкаИНН.Заголовок ="";
	Иначе 
		Элементы.ИНН.ЦветТекста = WebЦвета.Красный;
		Элементы.ОшибкаИНН.Видимость = Истина;
		Элементы.ОшибкаИНН.Заголовок ="";	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗапретНаРасшифровкуНаименования = ЗначениеЗаполнено(Объект.ПолноеНаименование) И РасшифровкаОПФНаименования(Объект.Наименование) <> Объект.ПолноеНаименование;
КонецПроцедуры
